{
  "alphabet_size": 11,
  "architectures": [
    "NTv3PreTrained"
  ],
  "attention_heads": 8,
  "attention_maps_to_save": [],
  "conv_init_embed_dim": 256,
  "deconv_layers_to_save": [],
  "deconv_phase": "odd",
  "deconv_upsample_type": "repeat+conv",
  "down_convolution_compute_dtype": "float32",
  "down_convolution_param_dtype": "float32",
  "embed_dim": 256,
  "embedding_compute_dtype": "float32",
  "embedding_param_dtype": "float32",
  "embeddings_layers_to_save": [],
  "ffn_embed_dim": 1024,
  "key_size": 32,
  "layer_norm_eps": 1e-05,
  "layernorm_compute_dtype": "float32",
  "layernorm_param_dtype": "float32",
  "lmhead_compute_dtype": "float32",
  "lmhead_param_dtype": "float32",
  "mask_token_id": 2,
  "model_type": "ntv3",
  "modulation_compute_dtype": "float32",
  "modulation_param_dtype": "float32",
  "num_downsamples": 7,
  "num_hidden_layers_head": 0,
  "num_layers": 2,
  "pad_token_id": 1,
  "stem_compute_dtype": "float32",
  "stem_param_dtype": "float32",
  "tie_word_embeddings": false,
  "token_embed_dim": 16,
  "torch_dtype": "float32",
  "transformer_ffn_compute_dtype": "float32",
  "transformer_ffn_param_dtype": "float32",
  "transformer_qkvo_compute_dtype": "float32",
  "transformer_qkvo_param_dtype": "float32",
  "transformers_version": "4.55.0",
  "up_convolution_compute_dtype": "float32",
  "up_convolution_param_dtype": "float32",
  "use_remat_in_convs": false,
  "use_remat_in_transformer": false,
  "use_skip_connection": true,
  "auto_map": {
    "AutoConfig": "configuration_ntv3_pretrained.Ntv3PreTrainedConfig",
    "AutoModelForMaskedLM": "modeling_ntv3_pretrained.NTv3PreTrained"
  },
  "_name_or_path": "InstaDeepAI/ntv3_base_model"
}
